#008 __xx__()
'''
魔术方法（magic methods） / “特殊方法”（special methods）
这些方法在特定情况下会被自动调用，通常与某种特定的语法或操作关联。

常见有：
例如：
__init__: 构造函数，用于初始化一个新创建的对象。
__del__: 析构函数，用于清理对象。
__str__: 返回一个对象的字符串表示。
__repr__: 返回一个对象的“正式”字符串表示。
__eq__: 用于比较两个对象是否相等。
__ne__: 用于比较两个对象是否不等。
__add__: 用于实现对象的加法运算。
__sub__: 用于实现对象的减法运算。
__mul__: 用于实现对象的乘法运算。
__truediv__: 用于实现对象的除法运算。
__floordiv__: 用于实现对象的整数除法运算。
__mod__: 用于实现对象的模运算。
__pow__: 用于实现对象的幂运算。
__len__: 返回容器的长度。
__getitem__: 获取容器中特定索引的元素。
__setitem__: 设置容器中特定索引的元素。
__delitem__: 删除容器中特定索引的元素。
__iter__: 返回一个迭代器，用于遍历容器。
__next__: 在迭代器中获取下一个值。
__contains__: 检查容器是否包含某个元素。
'''